help_text = """
Данный бот предназначен для текстовых/мини игр
в Телеграм с системой подсчета очков. Запуская его, вы сможете
сыграть с ботом в такие игры, как города, баскетбол, футбол и
кубик, соревнуясь с ботом.

<b> Доступые комманды: </b>

/start  -  Запустить бота
/help  -  Показать все комманды
/menu  -  Выйти в главное меню бота, где можно выбрать действия
/score  -  Показать все максимальные очки в твоих играх
/leaderbord  -  Показать списки лидеров в игры

<b>Если у вас остались какие то вопросы, пожалуйста, напишите в техподдержку!</b>
"""

technosupport_text = """
Ты обратился к техподдержке.
Контакт для связи с техподдержкой: @asynciogod
"""

roll_greeteng = """

Приветствую тебя!

Мы начали <b>игру в кубик</b> 🎲!

Твоя задача обыграть бота по очкам кубика. Чем больше очков тебе выпадает,
Тем сложнее будет боту тебя обыграть!
Очки вычисляются в конце игры (твои очки - очки бота).
После каждой игры они обновляются, так что постарайся обыграть бота!

Успехов!
"""

bascet_greeting = """
 
Приветствую! <b>Мы начали баскетбольный матч 🏀!</b>

Твоя задача: за 6 твоих бросков набрать очков больше, 
чем бот с тем же количеством бросков. <b>ИГРА ВЕДЕТСЯ ДО 6 БРОСКОВ!</b>

По завершению игры тебе присваивается статус "Победитель"  или статус "Проигравший",
А твои победные очки будут вычисляться по формуле (твои очки - очки бота).

После каждой игры они обновляются, так что постарайся обыграть бота!

Успехов, стань победителем!

"""

football_greeting = """
Приветствую! <b> Мы начали футбольный матч!⚽️</b>
Бей пенальти и забей больше раз, чем противник!

Твоя задача: Забить 3 гола быстрее, чем противник
<b>ИГРА ВЕДЕТСЯ ДО ТЕХ ПОР, ПОКА ТЫ, ЛИБО ПРОТИВНИК ЗАБЬЮТ 3 ГОЛА!</b>

По завершению игры тебе присваивается статус "Победитель"  или статус "Проигравший"
(В зависимости от того, кто быстрее забьет 3 гола)
А твои победные очки будут равнняться количеству твоих пенальти. Чем меньше, тем лучше!

После каждой игры они обновляются, так что постарайся обыграть бота!

Успехов, стань победителем!
"""

city_greeting = """

Привет! Начнем игру в <b>ГОРОДА?</b>

Твоя задача: тебе нужно назвать как можно больше
городов. <b>Но есть нюанс: ты и твой соперник называет реально
существующий город любой страны, название которого начинается на ту букву,
которой оканчивается название предыдущего города. А, и да: ГОРОДА НЕ ДОЛЖНЫ ПОВТОРЯТЬСЯ!</b>
Если город заканчивается на ь, ъ, ё или ы - Бери предстоящую букву.

По завершению игры тебе присваивается столько очков, сколько городов ты назвал.

Постарайся назвать столько, сколько сможешь!)
После каждой игры они обновляются, так что постарайся обыграть бота!

УДАЧИ!

"""